wlander/devmeter_stm32f4/Encoder/Timer.c
#include "stm32f4xx_tim.h"
#include "Timer.h"
#include "main.h"
#include "stm32f4xx.h"
#include "misc.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_gpio.h"

static TIM_ICInitTypeDef  TIM_ICInitStructure;

int TIM1_Init(void)
{
	TIM_TimeBaseInitTypeDef tim_struct;
  // TIM1 Configuration 
  TIM1_Config();

	// Конфигурация таймера
	tim_struct.TIM_Period = 65535;
	tim_struct.TIM_Prescaler = 0;
	tim_struct.TIM_ClockDivision = 0;
	tim_struct.TIM_CounterMode = TIM_CounterMode_Up;
	tim_struct.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM1, &tim_struct);

	
	//		- Режим захвата сигнала 1 (PE.9 - канал 1)
  TIM_ICInitStructure.TIM_Channel = TIM_Channel_1;
//  TIM_ICInitStructure.TIM_Channel = TIM_Channel_1 | TIM_Channel_3;
  TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
  TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
  TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
  TIM_ICInitStructure.TIM_ICFilter = 0x0;
  TIM_ICInit(TIM1, &TIM_ICInitStructure);
  
	//		- Режим захвата сигнала 2 (PE.13 - канал 3);
  TIM_ICInitStructure.TIM_Channel = TIM_Channel_3;
  TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
  TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
  TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
  TIM_ICInitStructure.TIM_ICFilter = 0x0;
  TIM_ICInit(TIM1, &TIM_ICInitStructure);
  
  /* TIM enable counter */
  TIM_Cmd(TIM1, ENABLE);
  TIM_ITConfig(TIM1, TIM_IT_CC1 | TIM_IT_Update, ENABLE);

}

/**
  * @brief  Configure the TIM1 Pins.
  * @param  None
  * @retval None
  */
void TIM1_Config(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  
  /* TIM1 clock enable */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);
  /* GPIOE clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);
  
  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_9 | GPIO_Pin_13;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;		// GPIO_Speed_100MHz
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOE, &GPIO_InitStructure);
	
  /* Connect TIM pins to AF1 */
//  GPIO_PinAFConfig(GPIOE, GPIO_PinSource9 | GPIO_PinSource13, GPIO_AF_TIM1);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource9, GPIO_AF_TIM1);
  GPIO_PinAFConfig(GPIOE, GPIO_PinSource13, GPIO_AF_TIM1);
 	TIM1_NVIC();
 
}

	// Разрешение прерывания таймера 1 по переполнению и по захвату сигнала каналов 1 и 2.
void TIM1_NVIC(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;

	// Разрешение прерывания таймера 1 по захвату сигнала
  NVIC_InitStructure.NVIC_IRQChannel = TIM1_CC_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

	// Разрешение прерывания таймера 1 по переполнению
	NVIC_InitStructure.NVIC_IRQChannel = TIM1_UP_TIM10_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

}

void INTTIM_Config(void)
{
	NVIC_InitTypeDef nvic_struct;
	TIM_TimeBaseInitTypeDef tim_struct;
	nvic_struct.NVIC_IRQChannel = TIM1_UP_TIM10_IRQn;
	nvic_struct.NVIC_IRQChannelPreemptionPriority = 2;
	nvic_struct.NVIC_IRQChannelSubPriority = 1;
	nvic_struct.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&nvic_struct);

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);
	tim_struct.TIM_Period = 65536 - 1;
	tim_struct.TIM_Prescaler = 1 - 1;
	tim_struct.TIM_ClockDivision = 0;
	tim_struct.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit(TIM1, &tim_struct);
	TIM_ITConfig(TIM1, TIM_IT_Update, ENABLE);
	TIM_Cmd(TIM1, ENABLE);
}

